anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
    return (rgb565);
}


/* generateGraticule --- precompute the scope graticule */

void generateGraticule(const struct ColourScheme *cp)
{
    int y;

    for (y = 0; y < GRAT_HT; y++)
    {
        Wgrat[y] = cp->graticule;

        if ((y % GRATICULE) == 0)
            Bgrat[y] = cp->graticule;
        else
            Bgrat[y] = cp->background;

        if ((y % 8) == 0)
            Dgrat[y] = cp->graticule;
        else
            Dgrat[y] = cp->background;

        if ((y == 1) || (y == ((GRAT_HT / 2) + 1)) || (y == ((GRAT_HT / 2) - 1)) || (y == (GRAT_HT - 2)) || ((y % GRATICULE) == 0))
            Tgrat[y] = cp->graticule;
        else
            Tgrat[y] = cp->background;

        if ((y % 2) == 0)
            C1grat[y] = cp->xcursor1;
        else
            C1grat[y] = cp->background;

        if ((y % 2) == 0)
            C2grat[y] = cp->xcursor2;
        else
            C2grat[y] = cp->background;
    }
}


void interpolateY(const uint8_t wave[], const int x, const int yoff, iliColr pixels[], const iliColr colr)
{
    int y1, y2;
    int y;

    y1 = wave[x] + yoff;

    if (x < (GRAT_WD - 1))
        y2 = wave[x + 1] + yoff;
    else
        y2 = y1;

    if ((y1 > 0) && (y1 < GRAT_HT) && (y2 > 0) && (y2 < GRAT_HT))
    {
        if (y2 < y1)
        {
            y = y1;
            y1 = y2;
            y2 = y;
        }

        for (y = y1; y <= y2; y++)
            pixels[y] = colr;
    }
}


void ili9486_renderFont(const int x1, const int y1, const iliColr fg, const iliColr bg, const uint8_t *const str)
{
    const int len = strlen(str);
    const int wd = len * FONT_WD;
    const int ht = FONT_HT;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    uint8_t bits, mask;
    iliColr pixel;
    
    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);
    
    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;
    
    while (PMMODEbits.BUSY)
        ;
    
    PMADDRbits.ADDR = 1;
    
    for (row = 0; row < FONT_HT; row++)
    {
        for (i = 0; i < len; i++)
        {
            bits = TileGlyph[str[i]][row];
            
            for (col = 0; col < FONT_WD; col++)
            {
                mask = 0x80 >> col;
                
                if (mask & bits)
                {
                    pixel = fg;
                }
                else
                {
                    pixel = bg;
                }
                
                while (PMMODEbits.BUSY)
                    ;

                PMDIN = pixel;
            }
        }
    }
    
    while (PMMODEbits.BUSY)
        ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


void ili9486_renderScaledFont(const int x1, const int y1, const int xmag, const int ymag, const iliColr fg, const iliColr bg, const uint8_t * const str)
{
    const int len = strlen(str);
    const int wd = len * FONT_WD * xmag;
    const int ht = FONT_HT * ymag;
    const int x2 = x1 + wd - 1;
    const int y2 = y1 + ht - 1;
    int i, row, col;
    int x, y;
    uint8_t bits, mask;
    iliColr pixel;

    iliCmd4(ILI9486_COL_ADDR, x1 >> 8, x1, x2 >> 8, x2);
    iliCmd4(ILI9486_PAGE_ADDR, y1 >> 8, y1, y2 >> 8, y2);

    PMADDRSET = _PMADDR_CS1_MASK;   // PMCS1 active

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 0;
    PMDIN = ILI9486_MEMORY_WR;

    while (PMMODEbits.BUSY)
        ;

    PMADDRbits.ADDR = 1;

    for (row = 0; row < FONT_HT; row++)
    {
        for (y = 0; y < ymag; y++)
        {
            for (i = 0; i < len; i++)
            {
                bits = TileGlyph[str[i]][row];

                for (col = 0; col < FONT_WD; col++)
                {
                    mask = 0x80 >> col;

                    if (mask & bits)
                    {
                        pixel = fg;
                    }
                    else
                    {
                        pixel = bg;
                    }

                    for (x = 0; x < xmag; x++)
                    {
                        while (PMMODEbits.BUSY)
                            ;

                        PMDIN = pixel;
                    }
                }
            }
        }
    }

    while (PMMODEbits.BUSY)
        ;

    PMADDRCLR = _PMADDR_CS1_MASK;   // PMCS1 inactive
    PMDIN = 0xffff; // Keep data bus high to work around a hardware problem
}


/* setLine --- draw a line between any two absolute co-ords */

void setLine(int x1, int y1, int x2, int y2, const iliColr fg)
{
    int d;
    int i1, i2;
    int x, y;
    const int dx = abs(x2 - x1);
    const int dy = abs(y2 - y1);

    if (((y1 > y2) && (dx < dy)) || ((x1 > x2) && (dx > dy)))
    {
        int temp = y1;
        y1 = y2;
        y2 = temp;

        temp = x1;
        x1 = x2;
        x2 = temp;
    }

    if (dy > dx)
    {
        int xinc;
        int yend;
        
        d = (2 * dx) - dy;       /* Slope > 1 */
        i1 = 2 * dx;
        i2 = 2 * (dx - dy);

        if (y1 > y2)
        {
            x = x2;
            y = y2;
            yend = y1;
        }
        else
        {
            x = x1;
            y = y1;
            yend = y2;
        }

        if (x1 > x2)
            xinc = -1;
        else
            xinc = 1;

        setPixel(x, y, fg);

        while (y < yend)
        {
            y++;
            
            if (d < 0)
                d += i1;
            else
            {
                x += xinc;
                d += i2;
            }

            setPixel(x, y, fg);
        }
    }
    else
    {
        int xend;
        int yinc;
        
        d = (2 * dy) - dx;  /* Slope < 1 */
        i1 = 2 * dy;
        i2 = 2 * (dy - dx);

        if (x1 > x2)
        {
            x = x2;
            y = y2;
            xend = x1;
        }
        else
        {
            x = x1;
            y = y1;
            xend = x2;
        }

        if (y1 > y2)
            yinc = -1;
        else
            yinc = 1;

        setPixel(x, y, fg);

        while (x < xend)
        {
            x++;
            
            if (d < 0)
                d += i1;
            else
            {
                y += yinc;
                d += i2;
            }

            setPixel(x, y, fg);
        }
    }
}


/* ellipse --- draw an ellipse using Bresenham's algorithm */

void ellipse(int x0, int y0, int x1, int y1, const int fg)
{
    // Based on code from http://members.chello.at/~easyfilter/bresenham.html
    int a = abs(x1 - x0);
    int b = abs(y1 - y0);
    int b1 = b & 1;
    int dx = 4L * (1 - a) * b * b;
    int dy = 4L * (b1 + 1) * a * a;
    int err = dx + dy + (b1 * a * a);
    int e2;

