anachrocomputer/PIC32PMP/ili9486test.X/ili9486test.c
    if (x0 > x1)
    {
        x0 = x1;
        x1 += a;
    }

    if (y0 > y1)
    {
        y0 = y1;
    }

    y0 += (b + 1) / 2;
    y1 = y0 - b1;

    a *= 8 * a;
    b1 = 8 * b * b;

    do
    {
        setHline(x0, x1, y0, fg);
        setHline(x0, x1, y1, fg);

        e2 = 2 * err;

        if (e2 <= dy)
        {
            y0++;
            y1--;
            err += dy += a;
        }

        if ((e2 >= dx) || ((2L * err) > dy))
        {
            x0++;
            x1--;
            err += dx += b1;
        }
    } while (x0 <= x1);

    while ((y0 - y1) < b)
    { 
        setHline(x0 - 1, x1 + 1, y0++, fg);
        setHline(x0 - 1, x1 + 1, y1--, fg);
    }
}


static void cpts(const int x0, const int y0, const int x, const int y, const iliColr fg)
{
    setHline(x0 - x, x0 + x, y0 + y, fg);
    setHline(x0 - x, x0 + x, y0 - y, fg);
    setHline(x0 - y, x0 + y, y0 + x, fg);
    setHline(x0 - y, x0 + y, y0 - x, fg);
}


/* circle --- draw a circle using Michener's algorithm */

void circle(const int x0, const int y0, const int r, const iliColr fg)
{
    int x, y;
    int d;

    x = 0;
    y = r;
    d = 3 - (2 * r);

    while (x < y)
    {
        cpts (x0, y0, x, y, fg);

        if (d < 0)
        {
            d += (4 * x) + 6;
        }
        else
        {
            d += (4 * (x - y)) + 10;
            y--;
        }

        x++;
    }

    if (x == y)
       cpts(x0, y0, x, y, fg);
}


/* drawBoxes --- draw some concentric squares */

void drawBoxes(void)
{
    uint32_t before, after;
    
    ili9486_fillRect(0, 80, 319, 319 + 80, ILI9486_ORANGE);
    before = millis();
    ili9486_fillRect(32, 112, 255 + 32, 255 + 112, ILI9486_WHITE);
    after = millis();
    ili9486_fillRect(64, 144, 191 + 64, 191 + 144, ILI9486_RED);
    ili9486_fillRect(96, 176, 127 + 96, 127 + 176, ILI9486_GREEN);
    ili9486_fillRect(128, 208, 63 + 128, 63 + 208, ILI9486_BLUE);
    
    printf("\n256x256 pixels took %dms\n", after - before);
}


/* drawGraduatedHues --- fill a rectangle with hues */

void drawGraduatedHues(void)
{
    uint32_t before, after;
    iliColr pixels[GRAT_HT];
    int x, y;

    before = millis();

    for (x = 0; x < GRAT_WD; x++)
    {
        memcpy(pixels, C1grat, sizeof (pixels));
    }

    after = millis();
    printf("\n%dx%d byte memcpy() took %dms\n", GRAT_WD, sizeof (pixels), after - before);

    for (y = 0; y < GRAT_HT; y++)
    {
        pixels[y] = hsvto565(y, MAXPRI, MAXPRI);
    }

    before = millis();

    for (x = 0; x < GRAT_WD; x++)
    {
        ili9486_pixMap(x + ((320 - GRAT_WD) / 2), (480 - GRAT_HT) / 2, 1, GRAT_HT, pixels);
    }

    after = millis();

    printf("\n%dx%d ili9486_pixMap() took %dms\n", GRAT_WD, GRAT_HT, after - before);
}


/* drawOscilloscopeDisplay --- draw a simulated digital oscilloscope display */

void drawOscilloscopeDisplay(void)
{
    uint32_t before, after;
    iliColr pixels[GRAT_HT];
    uint8_t wave1[GRAT_WD];
    uint8_t wave2[GRAT_WD];
    uint8_t wave3[GRAT_WD];
    uint8_t wave4[GRAT_WD];
    bool cursorMode = true;
    int xcursor1 = 34, xcursor2 = 241;
    int ycursor1 = 54, ycursor2 = 237;
    int yshift1 = 22;
    int yshift2 = -22;
    int yshift3 = 64;
    int yshift4 = 32;
    float theta1, delta1;
    float theta2, delta2;
    float offset1 = 128.0;
    float offset2 = 192.0;
    int x;
    
    // Synthesise four dummy waveforms
    delta1 = (M_PI * 4.0) / (float)GRAT_WD;
    delta2 = (M_PI * 8.0) / (float)GRAT_WD;

    for (x = 0; x < GRAT_WD; x++)
    {
        theta1 = (float)x * delta1;
        theta2 = (float)x * delta2;

        wave1[x] = (sin(theta1) * 50.0) + offset1;
        wave2[x] = (sin(theta2) * 50.0) + offset2;
        wave3[x] = sin(theta1) > 0.0? 32: 0;
        wave4[x] = sin(theta2) > 0.0? 32: 0;
    }
    
    before = millis();
        
    for (x = 0; x < GRAT_WD; x++)
    {
        // Draw the graticule, cursors or background
        if ((cursorMode == true) && (x == xcursor1))
            memcpy(pixels, C1grat, sizeof (pixels));
        else if ((cursorMode == true) && (x == xcursor2))
            memcpy(pixels, C2grat, sizeof (pixels));
        else if ((x == 1) || (x == ((GRAT_WD / 2) + 1)) || (x == ((GRAT_WD / 2) - 1)) || (x == (GRAT_WD - 2)))
            memcpy(pixels, Dgrat, sizeof (pixels));
        else if ((x % GRATICULE) == 0)
            memcpy(pixels, Wgrat, sizeof (pixels));
        else if ((x % 8) == 0)
            memcpy(pixels, Tgrat, sizeof (pixels));
        else
            memcpy(pixels, Bgrat, sizeof (pixels));

        // Add two Y-cursors
        if ((cursorMode == true) && ((x % 2) == 0)) {
            pixels[ycursor1] = LCDColours.ycursor1;
            pixels[ycursor2] = LCDColours.ycursor2;
        }

        // Add the four waveforms
        interpolateY(wave1, x, yshift1, pixels, LCDColours.trace1);
        interpolateY(wave2, x, yshift2, pixels, LCDColours.trace2);
        interpolateY(wave3, x, yshift3, pixels, LCDColours.trace3);
        interpolateY(wave4, x, yshift4, pixels, LCDColours.trace4);

        ili9486_pixMap(x + ((320 - GRAT_WD) / 2), (480 - GRAT_HT) / 2, 1, GRAT_HT, pixels);
    }

    after = millis();
    printf("\n%dx%d scope display took %dms\n", GRAT_WD, GRAT_HT, after - before);
}


/* drawText --- draw a block of text */

void drawText(void)
{
    uint32_t before, after;
    uint8_t str[32];
    int x, y;
    
    before = millis();
        
    for (y = 0; y < 16; y++)
    {
        for (x = 0; x < 16; x++)
        {
            uint8_t ch = (y * 16) + x;

            if (ch == 0)
                ch = ' ';

            str[x] = ch;
        }

        str[16] = '\0';

        ili9486_renderScaledFont((320 - (16 * FONT_WD * XMAG)) / 2, (y * FONT_HT * YMAG) + ((480 - (16 * FONT_HT * YMAG)) / 2), XMAG, YMAG, ILI9486_BLACK, hsvto565(y * 16, MAXPRI, MAXPRI), str);
    }

    after = millis();
    printf("\n%dx%d characters took %dms\n", 16, 16, after - before);
}


/* drawEllipses --- draw ellipses of different aspect ratios */

